Documents/ПеречислениеНалоговВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПеречислениеНалоговВБюджет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НалогиВзносыОтчисленияРасчетыСБюджетомИФондами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалогВзнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеречислениеНалоговВБюджет/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПлатежногоПоручения = РеквизитыПлатежногоПоручения();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
    ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
    
    Если НЕ ЭтоНовый() Тогда
        ЭтотОбъект.Движения.Записать();
    КонецЕсли; 

	Если Константы.ДатаКорректировкиВеденияУчетаПоДаннымНВО.Получить() <= ?(ЗначениеЗаполнено(Ссылка), Дата, ТекущаяДатаСеанса()) Тогда
		
	    Запрос = Новый Запрос;
	    Запрос.УстановитьПараметр("Ссылка", Ссылка);
	    Запрос.УстановитьПараметр("Организация", Организация);
	    Запрос.УстановитьПараметр("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	    Запрос.УстановитьПараметр("МесяцНалоговогоПериода", МесяцНалоговогоПериода);
	    Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
	    
	    КонецПериодаГраница = Новый Граница(Макс(?(ЗначениеЗаполнено(Ссылка), Дата, ТекущаяДатаСеанса()), КонецМесяца(МесяцНалоговогоПериода)));
	    Запрос.УстановитьПараметр("ДатаОстатков", КонецПериодаГраница); 
	    
	    Запрос.УстановитьПараметр("ВидПлатежа", ?(ЗначениеЗаполнено(ВидПлатежа), ВидПлатежа, Перечисления.ВидыПлатежейВГосБюджет.Налог));
	    Запрос.УстановитьПараметр("ВидДохода", ВидДохода);
	    
	    Запрос.Текст = ТекстЗапросаДанныеДляПроведения();
	    РезультатЗапроса = Запрос.Выполнить();
	    
	    ВыборкаВидНалогаВзносаОтчисления = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	    
	    Пока ВыборкаВидНалогаВзносаОтчисления.Следующий() Цикл 
	        
	        ОстатокНалогВзнос = ВыборкаВидНалогаВзносаОтчисления.НалогВзнос - ВыборкаВидНалогаВзносаОтчисления.НалогВзносОстаток;
	     
	        ВыборкаДетальныеЗаписи = ВыборкаВидНалогаВзносаОтчисления.Выбрать();     
	        КоличествоСписать = ВыборкаВидНалогаВзносаОтчисления.НалогВзнос;
	        
	        Пока КоличествоСписать > 0 И ВыборкаДетальныеЗаписи.Следующий() Цикл
	            
	            Если ВыборкаДетальныеЗаписи.НалогВзносОстаток <> 0 Тогда
	                НоваяСтрока = Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ДобавитьРасход();      
	                
	                КолПоПартии = МИН(КоличествоСписать, ВыборкаДетальныеЗаписи.НалогВзносОстаток);
	                ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	                НоваяСтрока.НалогВзнос = КолПоПартии;
	                
	                Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записать();
	                Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Ложь;
	                
	                КоличествоСписать = КоличествоСписать - КолПоПартии;
	            КонецЕсли;
	            
	        КонецЦикла;
	        
			Если ОстатокНалогВзнос > 0 Тогда
				
				ТекстСообщения = НСтр("ru = 'Сумма документа превышает сумму налога к перечислению на %1 (по виду дохода ""%2"" остаток к перечислению %3). При необходимости, скорректируйте сумму документа самостоятельно (проанализировать сумму остатка по видам дохода возможно, используя универсальный отчет по регистру накопления ""Налоги, взносы, отчисления - расчеты с бюджетом и фондами"").'");
	            ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ОстатокНалогВзнос, ?(ЗначениеЗаполнено(ВидДохода), ВидДохода, НСтр("ru = '<пустой>'")), ВыборкаВидНалогаВзносаОтчисления.НалогВзносОстаток);
	            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, ?(ВидДохода = Справочники.ВидыДоходов.ПустаяСсылка(), Отказ, Неопределено));
	            
	            ПеречисленныйНалог = ДанныеДляПроведения();     
				
				Для Каждого СтрокаДанных Из ПеречисленныйНалог Цикл
					
					Если ЗначениеЗаполнено(СтрокаДанных.МесяцНалоговогоПериода) Тогда
	                    
	                    НоваяСтрока = Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ДобавитьРасход();
	                    ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
	                    НоваяСтрока.НалогВзнос = ОстатокНалогВзнос;
	                    Если НЕ ЗначениеЗаполнено(СтрокаДанных.ВидДохода) Тогда
	                        НоваяСтрока.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя; 
	                    КонецЕсли;
	                    Если НЕ ЗначениеЗаполнено(СтрокаДанных.ВидПлатежа) Тогда
	                        НоваяСтрока.ВидПлатежа = Перечисления.ВидыПлатежейВГосБюджет.Налог; 
	                    КонецЕсли;
	                    Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записать();
	                    Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Ложь;
	                    
	                КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;    
		
	Иначе
		
		ПеречисленныйНалог = ДанныеДляПроведения();
		
		Если ПеречисленныйНалог = Неопределено Тогда
			Возврат
		КонецЕсли;
		Для Каждого СтрокаДанных Из ПеречисленныйНалог Цикл
			Если ЗначениеЗаполнено(СтрокаДанных.МесяцНалоговогоПериода) Тогда
				
				НоваяСтрока = Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.ДобавитьРасход();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
				
				Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записать();
				Движения.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Записывать = Ложь;
				
			КонецЕсли;
		КонецЦикла;
			
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Константы.ДатаКорректировкиВеденияУчетаПоДаннымНВО.Получить() > Дата Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидПлатежа"));		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РеквизитыПлатежногоПоручения() Экспорт
	
	РеквизитыПлатежногоПорученияПоДатеНомеру = 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		 	НСтр("ru = '№ %1 от %2'"), 
			ПлатежноеПоручениеНомер,  
			Формат(ПлатежноеПоручениеДата, "ДЛФ=D"));

	Возврат РеквизитыПлатежногоПорученияПоДатеНомеру
	
КонецФункции	

Функция	ТекстЗапросаДанныеДляПроведения()
		
    ТекстЗапросаДанныеДляПроведения = 
    "ВЫБРАТЬ
    |   НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки.Организация КАК Организация,
    |   НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
    |   НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки.ВидПлатежа КАК ВидПлатежа,
    |   НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки.ВидДохода КАК ВидДохода,
    |   СУММА(НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки.НалогВзносОстаток) КАК НалогВзносОстаток
    |ПОМЕСТИТЬ НалогиВзносыОтчисленияОстатки
    |ИЗ
    |   РегистрНакопления.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами.Остатки(
    |           &ДатаОстатков,
    |           Организация = &Организация
    |               И МесяцНалоговогоПериода <= &МесяцНалоговогоПериода
    |               И ВидНалогаВзносаОтчисления = &ВидНалогаВзносаОтчисления
    |               И ВидПлатежа = &ВидПлатежа
    |               И ВидДохода = &ВидДохода
    |               И РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане) КАК НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки
    |
    |СГРУППИРОВАТЬ ПО
    |   НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки.Организация,
    |   НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки.ВидНалогаВзносаОтчисления,
    |   НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки.ВидПлатежа,
    |   НалогиВзносыОтчисленияРасчетыСБюджетомИФондамиОстатки.ВидДохода
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   НалогиВзносыОтчисленияОстатки.Организация КАК Организация,
    |   НалогиВзносыОтчисленияОстатки.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
    |   НалогиВзносыОтчисленияОстатки.ВидПлатежа КАК ВидПлатежа,
    |   НалогиВзносыОтчисленияОстатки.ВидДохода КАК ВидДохода,
    |   СУММА(НалогиВзносыОтчисленияОстатки.НалогВзносОстаток) КАК НалогВзносОстаток
    |ПОМЕСТИТЬ ВТНалогиВзносыИтог
    |ИЗ
    |   НалогиВзносыОтчисленияОстатки КАК НалогиВзносыОтчисленияОстатки
    |                                            
    |ГДЕ
    |   НалогиВзносыОтчисленияОстатки.НалогВзносОстаток > 0
    |
    |СГРУППИРОВАТЬ ПО
    |   НалогиВзносыОтчисленияОстатки.ВидПлатежа,
    |   НалогиВзносыОтчисленияОстатки.ВидДохода,
    |   НалогиВзносыОтчисленияОстатки.ВидНалогаВзносаОтчисления,
    |   НалогиВзносыОтчисленияОстатки.Организация
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ПеречислениеНалоговВБюджет.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
    |   ПеречислениеНалоговВБюджет.Дата КАК Период,
    |   ПеречислениеНалоговВБюджет.Организация КАК Организация,
    |   ПеречислениеНалоговВБюджет.Сумма КАК НалогВзнос,
    |   ПеречислениеНалоговВБюджет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
    |   ПеречислениеНалоговВБюджет.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
    |   ПеречислениеНалоговВБюджет.ПлатежноеПоручениеНомер КАК ПлатежноеПоручениеНомер,
    |   ПеречислениеНалоговВБюджет.ПлатежноеПоручениеДата КАК ПлатежноеПоручениеДата,
    |   ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
    |   ПеречислениеНалоговВБюджет.ВидПлатежа КАК ВидПлатежа,
    |   ЕСТЬNULL(ВТНалогиВзносыИтог.НалогВзносОстаток, 0) КАК НалогВзносОстаток,
    |   ЕСТЬNULL(ВТНалогиВзносыИтог.ВидДохода, ПеречислениеНалоговВБюджет.ВидДохода) КАК ВидДохода
    |ИЗ
    |   Документ.ПеречислениеНалоговВБюджет КАК ПеречислениеНалоговВБюджет
    |       ЛЕВОЕ СОЕДИНЕНИЕ ВТНалогиВзносыИтог КАК ВТНалогиВзносыИтог
    |       ПО ПеречислениеНалоговВБюджет.Организация = ВТНалогиВзносыИтог.Организация
    |           И ПеречислениеНалоговВБюджет.ВидНалогаВзносаОтчисления = ВТНалогиВзносыИтог.ВидНалогаВзносаОтчисления
    |ГДЕ
    |   ПеречислениеНалоговВБюджет.Ссылка = &Ссылка
    |
    |УПОРЯДОЧИТЬ ПО
    |   ВидДохода
    |ИТОГИ
    |   МАКСИМУМ(НалогВзнос),
    |   СУММА(НалогВзносОстаток)
    |ПО
    |   ВидНалогаВзносаОтчисления";
    
	Возврат ТекстЗапросаДанныеДляПроведения;

КонецФункции

Функция	ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеречислениеНалоговВБюджет.МесяцНалоговогоПериода,
	|	ПеречислениеНалоговВБюджет.Дата КАК Период,
	|	ПеречислениеНалоговВБюджет.Организация,
	|	ПеречислениеНалоговВБюджет.Сумма КАК НалогВзнос,
	|	ПеречислениеНалоговВБюджет.РегистрацияВНалоговомОргане,
	|	ПеречислениеНалоговВБюджет.ВидНалогаВзносаОтчисления,
	|	ПеречислениеНалоговВБюджет.ПлатежноеПоручениеНомер,
	|	ПеречислениеНалоговВБюджет.ПлатежноеПоручениеДата,
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ПеречислениеНалоговВБюджет.ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|		ИНАЧЕ ПеречислениеНалоговВБюджет.ВидПлатежа
	|	КОНЕЦ КАК ВидПлатежа,
 	|	ПеречислениеНалоговВБюджет.ВидДохода КАК ВидДохода
	|ИЗ
	|	Документ.ПеречислениеНалоговВБюджет КАК ПеречислениеНалоговВБюджет
	|ГДЕ
	|	ПеречислениеНалоговВБюджет.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти
	
#КонецЕсли
